In [1]:
import pandas as pd

In [2]:
# .drop_duplicates()
# this method can be used on DataFrames; unlike .duplicated() which can only be performed on Series. 
df = pd.read_csv("employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.sort_values("First Name", inplace = True)
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2022-03-23 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2022-03-23 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2022-03-23 14:53:00,52119,11.343,True,Client Services

In [3]:
len(df)

1000

In [4]:
len(df.drop_duplicates())

1000

In [9]:
# keep = "first", removes all except first; "last", removes all except last, False removes all
df.drop_duplicates(subset = ["First Name"], keep = False)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
8,Angela,Female,2005-11-22,2022-03-23 06:29:00,95570,18.523,True,Engineering
688,Brian,Male,2007-04-07,2022-03-23 22:47:00,93901,17.821,True,Legal
190,Carol,Female,1996-03-19,2022-03-23 03:39:00,57783,9.129,False,Finance
887,David,Male,2009-12-05,2022-03-23 08:48:00,92242,15.407,False,Legal
5,Dennis,Male,1987-04-18,2022-03-23 01:35:00,115163,10.125,False,Legal
495,Eugene,Male,1984-05-24,2022-03-23 10:54:00,81077,2.117,False,Sales
33,Jean,Female,1993-12-18,2022-03-23 09:07:00,119082,16.180,False,Business Development
832,Keith,Male,2003-02-12,2022-03-23 15:02:00,120672,19.467,False,Legal
291,Tammy,Female,1984-11-11,2022-03-23 10:30:00,132839,17.463,True,Client Services

In [13]:
df.drop_duplicates(subset = ["First Name", "Team"])

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2022-03-23 10:20:00,61602,11.849,True,Marketing
440,Aaron,Male,1990-07-22,2022-03-23 14:53:00,52119,11.343,True,Client Services
137,Adam,Male,2011-05-21,2022-03-23 01:45:00,95327,15.120,False,Distribution
141,Adam,Male,1990-12-24,2022-03-23 20:57:00,110194,14.727,True,Product
302,Adam,Male,2007-07-05,2022-03-23 11:59:00,71276,5.027,True,Human Resources
...,...,...,...,...,...,...,...,...
149,NaN,Female,2014-08-17,2022-03-23 14:00:00,86230,8.578,True,Distribution
157,NaN,Female,2005-07-27,2022-03-23 08:32:00,79536,14.443,True,Product
269,NaN,Female,1992-08-02,2022-03-23 20:35:00,145316,18.517,True,Human Resources
329,NaN,Male,2010-01-27,2022-03-23 02:57:00,87760,14.987,True,Engineering
481,NaN,Female,2013-04-27,2022-03-23 06:40:00,93847,1.085,True,Business Development

In [14]:
df.drop_duplicates(subset = ["First Name", "Team"], inplace = True)
df.head(2)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2022-03-23 10:20:00,61602,11.849,True,Marketing
440,Aaron,Male,1990-07-22,2022-03-23 14:53:00,52119,11.343,True,Client Services

In [15]:
len(df)

769

In [16]:
# .unique() and .nununique() methods
df = pd.read_csv("employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.sort_values("First Name", inplace = True)
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2022-03-23 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2022-03-23 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2022-03-23 14:53:00,52119,11.343,True,Client Services

In [18]:
# Create an array of all unique values
df["Gender"].unique()

['Male', NaN, 'Female']
Categories (2, object): ['Female', 'Male']

In [21]:
len(df["Team"].unique())

11

In [22]:
# .nunique() => Number of Unique; does not include null values
df["Team"].nunique()

10

In [23]:
# use dropna = False parameter to include null values
df["Team"].nunique(dropna = False)

11